Tekla Open API Reference for Tekla Structures 2025
View.Attributes Property
 The view attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.ViewAttributes Attributes { get; set; }
Public Property Attributes As View.ViewAttributes
	Get
	Set
Property Value
Type: View.ViewAttributes
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace